from datasets import load_dataset
import json
from tqdm import tqdm


BENGALI_SLANGS = [
"অচুদা", "বাল", "বেইশ্যা", "মাগী", "ভগ", "ভোদা", "বোকাচোদা", 
"চোদা", "চুদ", "চুদানি", "চুদি", "চুতমারানি", "গাঁড়", "গুদ", 
"খানকি", "কুত্তা", "মাঙ", "ন্যাং", "পোঁদ", "মারানি", "পুটকি", 
"হাগু", "ভূসকি", "চোদ", "চুদা", "চুদে", "চোদাচুদি", "চুদন", 
"চুদানো", "চুদান", "চুদাই", "চুদছি", "চুদেছে", "চুদছ", "চুদেছ", 
"চুদবি", "চুদব", "চুদুক", "চুদছিল", "চোদাচোদা", "চোদন", 
"চোদানো", "চোদাতে", "চুদতে", "চোদাইছি", "চুদুনি", "চুদাল", 
"চুদাচুদি", "চোদাবাজ", "চোদাবাজি", "চুত", "চুতিয়া", "চুতিয়া", 
"চুতিয়", "চুতিয়্যা", "চুতিয়ে", "মাদারচোদ", "মাদারচোদা", 
"মাদারচোদার", "মা'রচোদ", "মাদারচোদে", "বেশ্যা", "রান্ডি", 
"রান্দি", "মাগি", "খানকী", "পুত্রচোদন", "বাচ্চাচোদা", "চোদারপোলা", 
"চোদারপুলা", "চোদাবাবু", "চুদবাজ", "চুদাবাজ", "চুদচুদ", "চুদচুদা", 
"চুদালি", "বংচোদ", "বাংলাচোদ", "বাংলাচুদ", "বাংলাচুদা",
"গান্ডু", "হারামজাদা", "হারামি", "ছেঁচড়া", "চুতমারানি", "চুদবাজি",
"চুতমারানী", "চুদবাজরা", "চুদোমারানি", "চুদুকু", "চুতমারানি", 
"বাচ্চাচোদ", "মাগিচোদ", "রান্দিচোদ", "চুতবাজ", "চুতবাজি",
"গুদখোর", "চোদখোর", "গান্ডখোর", "ভোদাখোর", "চোদাকেলি",
"গান্ডমারানি", "চোদনখোর", "গু খা", "গু মার", "হাগ", "হাগিস", 
"চুতমার", "চুদচুদি", "চুদাচুদানি", "চুদাকেলি", "গুদমার", 
"চোদাবাজরা", "চুদচুদানি", "চুদানি", "চুদাল", "চুদানি", "চোদাবাজরা"
]


ORIA_SLANGS = ["ଅଭଦ୍ର", "ବାଳ", "ବାଣ୍ଡ", "ବଡ଼", "ଘିଅ", "ବାଡିପୋଡ଼ା", "ବିଆ", "ଛୋଡ଼", "ମୁଣ୍ଡି", "ବର୍ବର", "ବାତକରା", "ପେଲା", "ବେଧ", "ଟୋକା", "ଟୋକେ", "ବେଧେଇ", "ପୁଅ", "ଗିହ", "ଭଉଣୀଘିଆ", "ଜଘନ୍ୟ", "ଗିହଣ", "ବୀଜ", "ଚୁଡ଼ି", "ବୁଜୁଳା", "ଛେଳିଘିଆ", "ଛୋଡ଼ି", "ଛୋଡ଼ିପୁଅ", "ଚୋଡ଼ିପୁଅ", "ଚୁକିବା", "ଦାନା", "ଫାଇଜାନ", "ଫୁସ", "ଚଟା", "କୁରା", "ଗାଣ୍ଡିଆ", "ଗାଣ୍ଡି", "ଗିଆ", "ମାର", "ଶଙ୍କର", "ଗାଣ୍ଡିରେ", "ଗାଈ", "ଦେ", "ଗେହିବା", "ଘୋଡ଼ା", "ଗେହିଁ", "ଗେହେଁ", "ଘୁଷୁରି", "ଘିଆ", "ଗୁଳ", "ଗନ୍ଧ", "ଗୋଷ୍ଠୀ", "ଗିଆଁ", "ହଗୁରା", "ମାଗିଆ", "ହିଞ୍ଜଡ଼ା", "ହିଞ୍ଜିଡ଼ା", "କୁକୁରଘିଆ", "ମଦରଚୋଟ", "ମୁଠି", "ଘିଅଣ", "ନଳୁଆ", "ପାଷାଣ୍ଡ", "ପେଲେଇ", "ପୁଡ଼ି", "ରାଣ୍ଡ", "ଧମକାନି", "ରାଣ୍ଡୀ", "ସେଣ୍ଟି", "ଗେହିବି", "ଥୁଳ", "ଘିଏଣ", "ଗିହେ", "ଗାହେଉଁ", "ମାଇପ", "ବିଆରେ", "ଗିହେଣ"]


KANNADA_SLANGS = [
"ಸುಳೆಮಗ",
"ಬೋಳಿಮಗ",
"ಹುಚ್ಚ",
"ಹುಚ್ಚಸುಳೆಮಗ",
"ಕೇಯ",
"ಹಡ",
"ಬೇವರ್ಸಿ",
"ತುಣ್ಣಿ",
"ತುಲ್ಲು",
"ರಂಡೆಮಡ",
"ರಂಡೆ",
"ಡಗಾರ್",
"ಬೋಸಡಿಕೆ",
"ಬೋಸಡಿಮಗನ",
"ಕೈಯಾ",
"ಸಿಂಗ್ರಿ ",
"ಗಾಂಡು",
"ಮಿಂಡ್ರಿ",
"ಮುಕಳಿ",
"ತಿಕ",
"ಶಾಟ",
"ಮುಕ್ಲಿಯಪ್ಪ",
"ಭಗನಿಗೂಟ"
                  ]

MALAYALAM_SLANGS = ["കുണ്ണ", "കുണ്ണൻ", "കുണ്ണപ്പാൽ", "കുണ്ണാടാ", "കുണ്ണപുട്ടി",
"പൂറ്", "പൂറൻ", "പൂറി", "പൂറണ്ടി", "പൂറ്റാവി", "പൂട്ടാവി", "പൂറ്റി",
"പുണ്ട", "പുണ്ടൻ", "പുണ്ടാച്ചി", "പുണ്ടമോനെ", "പുണ്ടമക്കൾ",
"മൈരൻ", "മൈറാ", "മൈരേ", "മൈറെ", "മൈര് പൊളി", "മൈര് പൊട്ട്",
"മൈരാടി", "മൈരാക്കൻ", "മൈരാട്ടി", "മൈരാട്ടൻ", "മൈരക്കുട്ടി",
"കൂന്തിയേ", "കൂതറ", "കൂത്തി", "കൂത്തിച്ചി",
"കണ്ടി", "കണ്ടറ", "കണ്ടച്ചി",
"കുണ്ടൻ", "കുണ്ടി", "കുണ്ടിമൈര്", "കുണ്ടിമോള", "കുണ്ടപ്പെണ്ണ്",
"ഊമ്പി", "ഊമ്പ്", "ഊമ്പിയ", "ഊമ്പൻ", "ഊമ്പട", "ഊമ്പടാ", "ഊമ്പിയടാ",
"തയൊളി", "തയൊളീ", "താഴോളി", "തള്ളേയൊളി", "തല്ലേഒത്ത",
"മണ്ടാച്ചി", "മണ്ടത്തി",
"ചീക്കൂത്തി", "ചൊക്ക", "കീപ്പ്",
"വെപ്പാട്ടി", "വേശ്യ", "വെശ്യ", "പെണ്ണിക്കുണ്ണ",
"പൂറ്റപ്പെണ്ണ്", "പുണ്ടപ്പെണ്ണ്",
"കീഴ്മൈര്", "ചീത്തമൈര്", "മൈര് പൊടി", "കുണ്ടിപെണ്ണ്",
"പുണ്ടിമൈര്", "പൂറ്റിമൈര്", "മൈര് കുണ്ണ",
"ഷണ്ഡൻ", "തേവടിച്ചി", "പണ്ണിയൊലി",
"കണ്ടിയാച്ചി", "കുണ്ണപ്പെണ്ണ്"]


ds = load_dataset("advaitIITGN/NLP_test", split="train")
finalAns = ""
with open("../../unity_AI_guard_v2_dataset/main_data.json", "r", encoding="utf-8") as f:
    lines = f.read().split("\n")
    for line in tqdm(lines):
        try:
            jsonLine = json.loads(line)
            jsonLine["profanity"] = 0
            if jsonLine["language"] == "bn":
                for slang in BENGALI_SLANGS:
                    if slang in jsonLine["text"]:
                        jsonLine["profanity"] = 1
                        break
            if jsonLine["language"] == "or":
                for slang in ORIA_SLANGS:
                    if slang in jsonLine["text"]:
                        jsonLine["profanity"] = 1
                        break
            if jsonLine["language"] == "kn":
                for slang in KANNADA_SLANGS:
                    if slang in jsonLine["text"]:
                        jsonLine["profanity"] = 1
                        break
            if jsonLine["language"] == "ml":
                for slang in MALAYALAM_SLANGS:
                    if slang in jsonLine["text"]:
                        jsonLine["profanity"] = 1
                        break
            del jsonLine["safety_categories"]
            del jsonLine["safety_distribution"]
            finalAns += json.dumps(jsonLine, ensure_ascii=False) + "\n"
        except Exception as e:
            print(e)

with open("binary.jsonl", "w", encoding="utf-8") as f:
    f.write(finalAns)


